//                                                  JavaScript

// ECMAScript – это взаимозаменяемый синоним с JavaScript. ECMA разработала пару стандартов для JS. Актуальным считается ECMAScript 6 версии от 2015 года

// ; (точка с запятой) - этот символ значит что строка завершена(необходимо ставить В конце каждой строки), но не ставится после функций(?)

// Методы вывода
console.log("Консоль лог говорит привет!");
console.info("Консоль инфо говорит привет!");
console.error("Консоль эррор говорит привет!");
console.warn("Консоль варн говорит привет!");
