// =================================================================================================================
//                                              Урок 1
// =================================================================================================================

// ECMAScript – это взаимозаменяемый синоним с JavaScript.
// ECMA разработала пару стандартов для JS. Актуальным считается ECMAScript 6 версии от 2015 года. Но многие браузеры ещё далеки от полной реализации этого стандарта. Изза этого стандарт ES5 тот, который полностью поддерживается современными браузерами.

// Для создания кода на JS нужно всего лишь текстовый редактор и браузер, в котором можно тестировать результат

// JavaScript – язык, что применяется на стороне клиента. Все действия могут происходить без перезагрузки страницы пользователя
