//                                                  JavaScript

// ECMAScript – это взаимозаменяемый синоним с JavaScript. ECMA разработала несколько стандартов для JS. Актуальным считается ECMAScript 6 версии от 2015 года

// JS - мультипарадигменный язык программирования(поддерживает ООП, императивный и функциональный стили)

// ; (точка с запятой) - этот символ значит что строка завершена(необходимо? ставить В конце каждой строки), но не ставится после функций(?)

/*
Многострочный комментарий
*/

// Методы вывода
console.log("Консоль лог говорит привет!");
console.info("Консоль инфо говорит привет!");
console.error("Консоль эррор говорит привет!");
console.warn("Консоль варн говорит привет!");

// Можно выводить через запятую
console.log("Вычитание: ", num1 - num2);    //=> Вычитание:  -10

// console.log не имеет возвращаемого значения (т.е. он просто возвращает значение undefined независимо от переданного значения)



//                                                Среда выполнения

// Среда выполнения дает вашему коду возможность взаимодействовать с программным обеспечением за пределами самого языка.

// JavaScript — это язык, который сильно зависит от среды выполнения. JS можно запускать в среде браузера, но существуют и другие среды, которые работают вне браузера, например Node.js.

// Среда браузера имеет несколько встроенных модулей, позволяющих взаимодействовать с веб-страницей. Вы можете использовать такие функции, как getElementById или XMLHttpRequest.



















//
