//                                              data-атрибуты

// data-атрибуты - это кастомные html атрибуты, в которые после "data-" мы может написать что угодно и передавать чтото(тег?) в JS-фаилы при их помощи. В HTML-документе они не функциональны(html-валидатор будет знать что это кастомный атрибут, браузер их не обрабатыает) и нужны только для передачи что-то в JS-код.

// data-атрибуты могут так же передавать различные параметры в JS-код для того чтобы определить какие-то варианты для поведения этих элементов

// Многие библиотеки использют свои data-атрибуты и нам нужно лишь добавить их к нужным элементам, чтобы получить соответсвующее им поведение
