//                                                 Modernizr

// ?? для старых браузеров, актуально ли хз ??

// Modernizr — это библиотека JavaScript, которая определяет функции, доступные в браузере пользователя. Это позволяет веб-страницам избегать неподдерживаемых функций, информируя пользователя о том, что его браузер не поддерживается, или загружая полифилл.

// Для всяких фишек например HTML5 которые не поддерживают определенные браузеры.

// Библиотека представляет собой только метод обнаружения функций и не добавляет отсутствующие функции в старые браузеры

// Добавляет новые фишки при работе со старыми браузерами в которых их нет.
